; TCP-Z language resource file

; http://msdn.microsoft.com/en-us/library/ms903928.aspx
; Locale identifier	Language	Sublanguage - locale	Default code page	Language code 
; 0x041e		Thai		Thailand		874			THA 

[info]
LanguageName=Thai (ไทย)
LanguageID=0x041E
CodePage=874
Translator=Pruthisith
Version=2.6
LastModified=2/27/2009

[Common]
AlreadyRun=กำลังทำงานอยู่...... ไม่จำเป็นต้องรันโปรแกรมอีกครั้ง
AboutBox=เ&กี่ยวกับ TCPZ...
Minimize=ย่อขนาด
OK=ตกลง
Success=เสร็จสิ้น
Fail=ผิดพลาด
SaveToFile=บันทึกเป็นไฟล์


[TCP]
Version=เวอร์ชั่น
FileLimit=ไฟล์จำกัด
MemoryLimit=ความจำจำกัด
OriginalFile=ต้นฉบับ
Yes=ใช่
No=ไม่
EVIDCount=EvID 4226
Connection=การเชื่อมต่อ
Established=เชื่อมต่อแล้ว
HalfOpen=Half Open
CreateDepth=Create Depth
Incoming=ขาข้า
Speed=ความเร็ว
Download=ดาวน์โหลด
Upload=อัปโหลด
Peak=ขีดจำกัดเมื่อก่อน
FailGetNicInfo=ไม่สามารถตรวจพบอุปกรณ์ Network
VersionNotMatch=เวอร์ชั่นของ tcpip.sys ไม่เข้ากับ OS ปัจจุบัน, TCP-Z จะถูกยกเลิก\n\nโปรแกรมนี้ไม่สามารถทำงานในโหมด compatibitly ได้!
FailGetVersion=ผิดพลาด, ไฟล์ tcpip.sys อาจถูกล๊อคอยู่
UnKnown=ไม่ทราบ
UnLimited=ไม่จำกัด,ถูกแก้ไข

[Statistics]
Statistics=สถิติ
TCPStatistics=สถิติของ TCP สำหรับ IPv4
DurationOfStatistics=ช่วงเวลาของสถิติ
OutgoingConnection=ความต้องการต่อออก
IncomingConnection=ความต้องการต่อเข้า
FailedConnection=ค่าผิดพลาดในการเชื่อมต่อ
EstablishedConnection=ความสำเร็จในการเชื่อมต่อ
SuccessRatio=สัดส่วนในความสำเร็จ
Reset=ล้างค่า
AdapterInfo=ข้อมูลของอุปกรณ์ Network
DeviceType=ประเถทอุปกรณ์
OperateStatus=สถานะการทำงาน
LinkSpeed=ความเร็วของ Link
TransmitSpeed=ความเร็วของการส่ง
ReceiveSpeed=ความเร็วของการรับ
; // A: This "UP" comes from c++ header file, means active, connected
Up=ขึ้น
Down=ลง
Ethernet=Ethernet
PPP=PPP
Wireless=Wireless


[Detail]
Detail=รายละเอียด
Process=ส่วนทำงาน
PID=PID
ProcessInfo=ข้อมูลของส่วนทำงาน
; These info is same as Windows Task Manager
MemUsage=การใช้งานความจำ
VMSize=VM Size
IORead=I/O Read
IOWrite=I/O Write


[Patch]
Patch=ตัวแก่ไข
PatchMemory=แก้ไขหน่วยความจำ
PatchFile=แก้ไขไฟล์ Tcpip.sys
OldValue=ค่าเก่า
NewValue=ค่าใหม่
Offset=Offset
Apply=ทำการ
MsgMemPatch=แก้ไขค่าจำกัด half-open ในหน่วยความจำ kernel\nจะเห็นผลในทันที\n\nค่าที่ถูกใช้งานไปจะทำงานได้,ยกเว้นเมื่อทำการ restart เครื่องแล้ว
TipMemPatch=เกี่ยวกับแก้ไขหน่วยความจำ
Open=เปิด
MsgTipMemPatch=ถ้าต้องการทำงานออโต้, ลอง TCP-Z Virtual Device.\nโดยการติดตั้งครั้งเดียว, ค่าจำกัดของ half-open connection จะถูกล๊อคตั้งแต่ตอน Boot เครื่อง
MsgFilePatch=Restart  เครื่องเพื่อเห็นการเปลี่ยนแปลง\n จำเป็นต้องทำแค่ครั้งเดียว\n\n การแก้ไขไฟล์ใน Vista, ลอง 'Universal Tcpip.sys Patch'

InvalidValue=ค่าใหม่นั้นผิดพลาด!
ComfirmPatchFile=คุณแน่ใจแล้วหรือว่าต้องการแก้ไขไฟล์ Tcpip.sys?
FailDisableWFP=ผิดพลาดในการปิด Windows File Protection.\n\nหรือ, WFP function ได้ถูกปิดใช้งานไปก่อนนี้แล้ว

UnsupportedOS=เวอร์ชั่นของ OS นี้ไม่สามารถใช้งานได้
FailExtractFile=ผิดพลาดในการแตกไฟล์ driver.
FailLoadDriver=ผิดพลาดในการโหลด driver. \nโปรดรันโปรแกรมในนี้แบบ admin, โดยทำการ right-click ที่ตัวโปรแกรมแล้วเลือก run as administrator.\n\nโปรแกรม anitivirus บางตัวอาจทำการบล๊อคการโหลด driver, คุณจำเป็นต้องกฏของโปรแกรม
LoadErrorCode=ผิดพลาดในการโหลด tcp-z driver. โค๊ดผิดพลาด:
FailOpenSCM=ผิดพลาดในการเปิด Service Control Manager. ไม่มีสิทธิในการเข้าถึง
FailCreateService=ผิดพลาดในการสร้าง service
FailStartService=ผิดพลาดในการเริ่ม service
TestsigningNotEnable=TESTSIGNING สถานะถูกปิดใช้\n\nข้อมูลเพิ่มเติม, อ่าน Readme.txt.\n\nต้องการเปิดใช้งาน TESTSIGNING เดี๋ยวนี้เลยหรือไม่?
TestsigningSetOK=TESTSIGNING สถานะถูกเปิดอยู่\n\nถ้าหากว่ามีการแสดงข้อความ 'Test Mode' ชึ้นบน desktop, คุณสามารถลบมันออกได้โดยใช้ 'RemoveWatermarkX64.exe'.\n\nคุณต้อง restart เครื่องเพื่อเห็นการเปลี่ยนแปลง

SetSuccess=ค่าจำกัด TCP Half Open connection ถูกเปลี่ยนเป็น:
SetFail=ผิดพลาดในการตั้งค่าใหม่


[About]
About=เกี่ยวกับ
ReadMe=ReadMe and Help ...

[MiniBar]
Active=ทำงาน
Statistics=สถิติ


[LanguageDialog]
LangChanged=หน่วยการแสดงผลได้ถูกเปลี่ยนภาษาแล้ว, คุณต้องทำการ restart โปรแกรมถึงจะเห็นการเปลี่ยนแปลง


[PopupMenu]
ShowTCPZ=แ&สดง / ซ่อน TCP-Z
OnTopmost=อยู่หน้าบนสุด
ShowMinibar=แสดง / ซ่อน Minibar
Transparent=อัตราความโปร่งใส
CaptureTCPZ=จับภาพหน้าต่าง TCP-Z
CaptureScreen=&จับภาพหน้าจอ
RefreshNicList=&ฟื้นคืนรายชื่ออุปกรณ์
Exit=&ปิด